[{
  "type": "oli",
  "title": "E Hō Mai",
  "lyrics": "E hō mai ka ʻike mai luna mai e\nO nā mea huna noʻeau no nā mele e\nE hō mai\nE hō mai\nE hō mai",
  "englishTranslation": "Grant us the knowledge from above\nConcerning the hidden wisdom of songs,\nGrant,\nGrant,\nGrant us these things",
  "language": "haw",
  "author": "Edith Kenao Kanakaʻole",
  "sourceUrl": "https://blogs.ksbe.edu/alohaainaproject/e-ho-mai/",
  "notes": "Kumu hula master and Hawaiian cultural and language expert, Edith K. Kanakaʻole (affectionately known as Aunty Edith), composed this oli (chant) for her hula troupe, Hālau O Kekuhi. The chant was originally performed by students at the beginning of class to request knowledge and wisdom from the ancestral deities to accomplish the task at hand.\n\nToday, this oli is commonly used at the start of an event or small gathering to focus a groupʻs energies and ultimately carry out the kuleana (responsibility) they have undertaken. It is recommended that haumana (students) use this chant to help them seek knowledge and clear their minds of any negativity."
}, {
  "type": "oli",
  "title": "Ola i ka Hā",
  "lyrics": "Ola i ka hā\nOla i ka wai\nOla i ka ʻī\nHāwaiʻī, Hāwaiʻī, Hāwaiʻī\nWākea ka lani\nPapa ka hōnua\nNo ka lunā, ko lunā\nNo ka lalo, ko lalo\nO ka pono no ia e\nE ola kākou a mau loa e",
  "englishTranslation": "There is life in the breath (hā – Hāloa/kalo)\nThere is life in the waters (Kāneikawaiola – god of creation)\nThere is life in the supreme (Kumulipo chant of Kalaninuiʻīamamao)\nHā – wai – ʻī (reflecting the genealogies of creation of Hawaiʻi, God, the environment and humankind)\nWākea of the heavens\nPapa of the earth\nFor up belonging up\nFor down belonging down\nIt is the “Natural Order”\nMay we live forever",
  "language": "haw",
  "author": "Frank Kawaikapuokalani Hewett",
  "sourceUrl": "https://blogs.ksbe.edu/alohaainaproject/ola-i-ka-ha/",
  "notes": "Ola i ka hā\nThe first line is a reflection of the legend of the origin of the kalo, the child of Wākea and Hoʻohōkūkalani who soon after birth expired.  This child was buried near their home and from his body grew forth the kalo plant. A second son was born to Wākea and Hoʻohōkūkalani and he became the father of the human race. Like his elder brother, he was also named Hāloa with the epithet nakalaukapalili added to his name. The first birth of t he first Hāloa established the tradition of the senior line in the Hawaiian tradition, and the birth of the second Hāloa established the tradition of the junior line subservient to the senior line, humankind as custodians to the gods who manifest in nature /environm·ent. The word hā used in the first line is a reflection of the names Hāloa and Hāloanakalaukapalili.\n\nOla i ka wai\nThe· second line is a reflection of the god, Kāne, the god creation. Kāne has many forms, which include the water, the sunlight, and the rainbow. Kāne is the giver of life and not the taker of life, therefore no human sacrifices were offered to him. He is at the zenith in the pantheon of gods  and the other gods are said  to be lesser manifestations of him. Kāne worship incorporated shrines with sacred upright stones where prayers and offerings were left.\n\nIn order for the kalo to grow tall and strong it needs both water and sunlight, both manifestations as mentioned earlier of the god, Kāne. An ancient proverb states, “Pūʻaliʻali kalo I ka wai ʻole,” without water the kalo grows misshapen or crooked. Kāne in the form of water not only provides sustenance for good healthy growth of the kalo but also provides sustenance – the same for mankind.\n\nThe work “wai,” in the second line, is a reflection to the god, Kāneikawaiola – the god of the living or healing waters.\n\nOla i kaʻī\nThe third line is a reflection of the Kumulipo chant that was used as a prayer for the dedication of the chief Lonoikamakahiki to the gods soon after his birth. It is at that time that the honors of Kapu, Wela, Hoano and Moe were conferred to him by his father, Keawekekahialiʻiokamoku, King of Hawaiʻi. After the ceremony his name was changed to Ka-ʻĪ-ʻi-mamao. The third line also reflects the name of ʻĪo, the tradition of one supreme deity connected to the workship of the ʻio (hawk) and the pueo (owl).\n\nHāwaiʻī, Hāwaiʻī, Hāwaiʻī\nThe fourth line connects the three components, the hā, the wai and the ʻī in the name Hāwaiʻī, the breath or the air that we breathe, the water that we drink and god/goddess most superior. Air and water sustains the life created through the god. As explained to me by Aunty Emma deFries in our study of the supreme one god Īo, the island names that end with (ʻi) such as Hāwaiʻi, Mauʻi, Molokaʻi, Lānaʻi and Kauaʻi became so in our ancient past due to the ruling chiefs who collectively worshipped the supreme god, ʻIo. In my study with Aunty Emma, ʻIo was referred to as ʻĪ-o-na-lani-nui-a-mamao (the Supreme most god of the great heavens and beyond.) Aunty Emma asked me to always keep this tradition close to me.\n\nWākea ka lani\nPapa ka hōnua\nNo ka luna ko luna\nNo kalalo ko lalo\nʻO ka pono no ia e\n\nThe fifth, sixth, seventh, eighth and ninth lines reflect the “natural order” of our gods, environment and people. To everything there is a natural or proper order. There is a beginning and an end, a top and a bottom, a male god and a female counterpart. There is harmony, balance and unity. The gods are at the top of the triad followed by the environment and then humankind. The same order is reflected in the social structure as established in the kapu system, aliʻi, kahuna, makaʻāinaaā and kauwā along with terms and roles within the ʻohana such as kūpuna, mākua, ʻōpio, keiki and kamaiki. From the top to the bottom, all is in its proper place. This is truly our pono. Not as translated as the word, “righteousness,” but the natural order as allotted like mana by the god/goddess.\n\nThe tenth line reflects the life, health and healing, which we attribute to our gods. The kalo and the human race were born from Wākea and Hoʻohōkūkalani. The life force is in the manifestations of the god Kāne, the sun, the air and the rainbow. All of this is perpetuated by the pono, the natural order, the balance and the unity.\n\n(Manaʻo from Frank Kawaikapuokalni Hewett)"
}, {
  "type": "oli",
  "title": "Oli Mahalo",
  "lyrics": "ʻU hola ʻia ka maka loa la\nPūʻai ke aloha la\nKūkaʻi ʻia ka Hāloa la\nPā wehi mai nā lehua\nMai ka hoʻokuʻi a ka hālāwai la\nMahalo, e ke akua\nMahalo, e nā kūpuna la ea\nMahalo, me ke aloha la\nMahalo, me ke aloha la",
  "englishTranslation": "To spread forth, open up the most fine quality mat\nExchange/share as potluck or aloha\nExchange as greetings (between man and wife and descendants)\nTo adorn with the lehua flower\nFrom East to West; sunrise to sunset, we are discoverers, navigators, take care of our ʻāina\nWe thank our creators\nWe thank our ancestors\nWe thank you with love\nWe thank you with love",
  "language": "haw",
  "author": "Kehau Smith",
  "sourceUrl": "https://blogs.ksbe.edu/alohaainaproject/oli-mahalo/",
  "notes": "This oli was composed as a greeting of thanks for hospitality, love, generosity and knowledge that is given to us. It also gives thanks to the beauty of the islands and our people. Hāloa is ever-lasting breath. The kalo plant is considered our ancestor that is cherished and preserved. Makaloa is the finest mat woven. It is considered higher quality that lau hala. The message is that it is important for us to practice being “thankful” every day."
}, {
  "type": "oli",
  "title": "Oli Aloha",
  "lyrics": "Onaona i ka hala me ka lehua\nHe hale lehua no ia na ka noe\nO kaʻu no ia e ʻanoʻi nei\nE liaʻa nei hoʻi o ka hiki mai\nA hiki mai no ʻoe\nHiki pu no me ke aloha\nAloha e, aloha e",
  "englishTranslation": "Fragrant with the breath of hala and lehua\nThis is the sight I long to see\nOf this, my present desire\nYour coming fills me with eagerness\nNow that you have come\nLoves comes with you\nGreetings, greettings",
  "language": "haw",
  "author": null,
  "sourceUrl": "https://www.huapala.org/Chants/Oli_Aloha.html",
  "notes": null
}, {
  "type": "oli",
  "title": "Oli Hoʻi",
  "lyrics": "Hoʻi e, hoʻi la\nHo’i e ka ʻohu e\nI ka ua lehua\nAʻo kula Manu e\nʻ Onaona i ke ala\nLau ʻo ke kupukupu\nKupu aʻe ke aloha\nNoho pono i ka niʻo\nAe, ae, ae, ae\nHe inoa no Hiʻiaka i ka poli ʻo Pele",
  "englishTranslation": "They return, return\nThe mists return once again\nTo the upland home of lehua\nThe haunt of many birds\nVery sweet is the fragrance\nOf the leaves of the fern\nThere love sprouted and grew\nTo dwell on the heights\nTra la la\nThe name of Hiʻiaka-in-the-bosom-of-Pele",
  "language": "haw",
  "author": null,
  "sourceUrl": "https://www.huapala.org/Chants/Oli_Hoi.html",
  "notes": null
}, {
  "type": "oli",
  "title": "Nani Wale Kuʻu ʻIke",
  "lyrics": "Nani wale kuʻu ʻike ʻana lā\nLā i ka luna lā o Kalalea lā\nE noha ana e koa mano lā\nLā i ka wai Kûʻauhoe lā\nA kau ane e ka pāpala lā\nLā i ka lae o Makuaiki lā\nAʻo ka iki ʻau hau iho ia lā\nLā a e welo ai kô, kô piko lā\nE ô mai aʻo ʻEmalani lā\nLā pua ʻoliwa,\nHe inoa lā a\nHe inoa no ʻEmalani",
  "englishTranslation": "It was wonderful to see\nThe upland of Kalalea\nThere stood the great koa tree\nBeside the pool Kûʻauhoe\nThe setting sun shone down\nOn the brow of Makuaiki\nThere is just enough light left\nTo light the top of the peak\nAnswer my call, Emmalani\nO my olive blossom\nTo your name song,\nA name song for Emmalani",
  "language": "haw",
  "author": null,
  "sourceUrl": "https://www.huapala.org/Chants/Nani_Wale_Kuu_Ike.html",
  "notes": " Translation by Mary Pûkuʻi - Chant composed when Queen Emma visited Kauaʻi. Stanza 7, Makuaiki is a ridge on the Nā Pali coast."
}, {
  "type": "oli",
  "title": "Kīlauea",
  "lyrics": "A ka luna o Kīlauea\nI ke ahi a ka wahine\nHaʻa ana ka wahine Pele\nʻŪhi ʻūhā mai ana lā\nNome ana ʻo Pele i Puna\nAia ka palena aʻi kai ʻeā\nHe inoa nou aʻe Pele ʻeā\nKa wahine noho a i Kīlauea\nHoʻi nō e ke kapu i Kīlauea\nE ola mākou a mau loa\n\nKahea:\nHe inoa nō Pele",
  "englishTranslation": "Up at Kīlauea\nLives the fire of the lady\nMadame Pele moves\nCreaking and crackling as she goes\nPele moves to Puna\nThe end is in the sea\nThy name is Pele\nThe lady that lives at Kīlauea\nAll kapu remains at Kīlauea\nAnd may we live forever\n\nCall:\nThe name of Pele",
  "language": "haw",
  "author": "Alice Nāmakelua",
  "sourceUrl": "https://www.huapala.org/Chants/Kilauea.html",
  "notes": "Source: Hillier Collection, Translation by Kini Sullivan"
}, {
  "type": "oli",
  "title": "ʻAuʻa ʻIa E Kama I Kona Moku",
  "lyrics": "ʻAuʻa ʻia e Kama e kona moku\nE kona moku e Kama e ʻauʻa ʻia\nKe kama kama kama kama i ka hulu nū\nKe kama kama kama kama i ka huli au\nHulihia pāpio a i lalo i ke alo\nHulihia i ka imu\nO Ku ka Makiʻi lohelohe\nʻO ka hana ʻana i hiki ʻōhulehule\nKaʻa ʻia ka ʻalihi aʻo pōhaku\nMe ka ʻupena aku aʻo ihu aniani\nO ka unu o Niuolaniolaʻa\nO Keawe ʻai kū ʻai a laʻahia\nNāna i halapepe ka honua o ka moku\nI haʻale ʻia i ke kiu welo kā i ka puʻu\nKōwelo lohi aʻo Kanaloa",
  "englishTranslation": "Kama refused to part with his island\nThis is the land held back by Kama\nThe son Kama, the highest born\nThe son Kama, who reigns\nHe turns his foes face down (kills them)\nHe turns them into the imus\nThen and lays them before his idols\nHe rids the land (of foes) till none exist\nHe rolls them aside as he does stones\nHe draws them in as he does his nets\nTo his temple Niuolaniolaʻa\n(built) By Keawe, the most sacred one\nHe who ruled and made the island subject to him\nHis power arose to the summit of the hills\nHe is the powerful descendant of Kanaloa",
  "language": "haw",
  "author": "Keaulumoku",
  "sourceUrl": "https://www.huapala.org/Chants/AuaIaEKamaIKonaMoku.html",
  "notes": "Source: Keakaokalā Kanahele - This mele inoa for Aikanaka, maternal grandfather of Queen Liliʻuokalani, was composed by Keaulumoku, a priest, and published in the Hawaiian Newspaper \"Na Mele Aimoku\", 1886. Kama, short for Kamalalawalu was a chief of Maui. Imu are earthern ovens and makiʻi lohilohi is the word for both the sacred cord and/or ritual. The chant refers to the rites of human sacrifice at heiau luakini. Translated by Mary Pukui."
}, {
  "type": "oli",
  "title": "E Ulu",
  "lyrics": "E ulu kini o ke akua\nUlu aʻe o Kāne me Kanaloa\nUlu ka ʻôhiʻa lau ka wai ka ʻieʻie\nUlu aʻe ke kua a noho i kona kahu\nEia ka wai la, ka ʻawa, he wai ola\nE ola iaʻu i ke kumu\nE ola i ka poʻo puaʻa\nE ola i ke paepae\nE ola i nā haumana a pau\nElieli kapu, elieli noa",
  "englishTranslation": "Increase our knowledge, multitude of gods\nInspire us, Kāne and Kanaloa\nGrow and nourish us like the ʻôhiʻa leaf and the ʻieʻie\nInspire the guardian to stay and persevere\nHere is the water, the ʻceremonial ʻawa, the water of life\nGive life to the source\nGive life to the leader\nGive life to the hula assistant\nLife to all the students\nProfound the kapu, profound its lifting",
  "language": "haw",
  "author": null,
  "sourceUrl": "https://www.huapala.org/Chants/E_Ulu.html",
  "notes": "Source: This chant is a prayer to inspire, understand and perform hula correctly. Stanza 3, the ʻieʻie was one of 5 plants used on the hula kuaʻahu (altar). Stanza 5, ʻāwa was used as a ceremonial drink."
}, {
  "type": "oli",
  "title": "ʻAnoʻai",
  "lyrics": "ʻAnoʻai kuʻu wehi lā\nI ka ua Kanilehua\nPua nani ka lehua lā\nNo Hilo Hanakahi\nAʻo kuʻu ipo ia lā\nI ke kai aʻo Mokuola\nKui ʻia me ke ʻala lā\nO nā hala aʻo Puna\nHaʻina kuʻu wehi lā\nI ka ua Kanilehua",
  "englishTranslation": "Greetings to my love\nIn the Kanilehua rain\nBeautiful is the lehua blossom\nOf Hilo Hanakahi.\nMy sweetheart is\nIn the sea of Mokuola.\nIntermingled with the fragrance\nOf the hala of Puna.\nTell of my love\nIn the Kanilehua rain",
  "language": "haw",
  "author": null,
  "sourceUrl": "https://www.huapala.org/AM/Anoai.html",
  "notes": "Source: Hiona collection - This ancient chant set to music, honors Hanakahi (deeds-done-in-unison), an ancient peace-loving chief who ruled the Hilo district. Wehi, an adornment is a sweetheart and Kanilehua (rain that sings upon the lehua) is the name of the Hilo rain. The red ʻohiʻa lehua is the symbol of the island of Hawaiʻi. Mokuola or Island of Life, is in Hilo Bay. Legend says, if one swam around Mokuola 3 times, health would be gained. Umbilical cords of babies were deposited there to insure a healthy life. Puna was famous for its hala (pandanus) and the natives of the area were skillful weavers of the leaves. Translation by Kaiu Kanoa. Hawaiian Text edited by Puakea Nogelmeier"
}]
